let obj = {
  morning: {
    name: "أذكار الصباح",
    list: [
      "   أعوذ بالله من الشيطان الرجيم الله لا إلـه إلا هو الحي القيوم لا تأخذه سنة ولا نوم له ما في السماوات وما في الأرض من ذا الذي يشفع عنده إلا بإذنه يعلم ما بين أيديهم وما خلفهم ولا يحيطون بشيء من علمه إلا بما شاء وسع كرسيه السماوات والأرض ولا يؤوده حفظهما وهو العلي العظيم",

      `    بسم الله الرحمن الرحيم
        قل هو ٱلله أحد، ٱلله ٱلصمد، لم يلد ولم يولد، ولم يكن لهۥ كفوا أحدۢ.(3 مرات)`,

      ` بسم الله الرحمن الرحيم
    قل أعوذ برب ٱلفلق، من شر ما خلق، ومن شر غاسق إذا وقب، ومن شر ٱلنفٰثٰت فى ٱلعقد، ومن شر حاسد إذا حسد.(3 مرات) `,

      `بسم الله الرحمن الرحيم
        قل أعوذ برب ٱلناس، ملك ٱلناس، إلٰه ٱلناس، من شر ٱلوسواس ٱلخناس، ٱلذى يوسوس فى صدور ٱلناس، من ٱلجنة وٱلناس.(3 مرات)`,

      ` أصـبحنا وأصـبح المـلك لله والحمد لله ، لا إله إلا الله وحده لا شريك له، له المـلك وله الحمـد، وهو على كل شيء قدير ، رب أسـألـك خـير ما في هـذا اليوم وخـير ما بعـده ، وأعـوذ بك من شـر ما في هـذا اليوم وشر ما بعـده، رب أعـوذبك من الكسـل وسـوء الكـبر ، رب أعـوذ بك من عـذاب في النـار وعـذاب في القـبر. `,

      `اللهـم بك أصـبحنا وبك أمسـينا ، وبك نحـيا وبك نمـوت وإلـيك النـشور. `,

      `اللهـم أنت ربـي لا إله إلا أنت ، خلقتنـي وأنا عبـدك ، وأنا علـى عهـدك ووعـدك ما استـطعـت ، أعـوذبك من شـر ما صنـعت ، أبـوء لـك بنعـمتـك علـي وأبـوء بذنـبي فاغفـر لي فإنـه لا يغـفر الذنـوب إلا أنت . `,

      `اللهـم إنـي أصبـحت أشـهدك ، وأشـهد حملـة عـرشـك ، وملائكتك ، وجمـيع خلـقك ، أنـك أنـت الله لا إله إلا أنـت وحـدك لا شريك لـك ، وأن محمـدا عبـدك ورسـولـك. `,

      `اللهـم ما أصبـح بي مـن نعـمة أو بأحـد مـن خلـقك ، فمـنك وحـدك لا شريك لـك ، فلـك الحمـد ولـك الشكـر. `,

      `اللهـم عافـني في بدنـي ، اللهـم عافـني في سمـعي ، اللهـم عافـني في بصـري ، لا إله إلا أنـت. اللهـم إنـي أعـوذ بك من الكـفر ، والفـقر ، وأعـوذ بك من عذاب القـبر ، لا إله إلا أنت `,

      `حسبـي الله لا إله إلا هو علـيه توكـلت وهو رب العرش العظـيم.(7 مرات)`,

      `اللهـم إنـي أسـألـك العـفو والعـافـية في الدنـيا والآخـرة ، اللهـم إنـي أسـألـك العـفو والعـافـية في ديني ودنـياي وأهـلي ومالـي ، اللهـم استـر عـوراتي وآمـن روعاتـي ، اللهـم احفظـني من بـين يدي ومن خلفـي وعن يمـيني وعن شمـالي ، ومن فوقـي ، وأعـوذ بعظمـتك أن أغـتال من تحتـي. `,

      `اللهـم عالـم الغـيب والشـهادة فاطـر السماوات والأرض رب كـل شـيء ومليـكه ، أشهـد أن لا إلـه إلا أنت ، أعـوذ بك من شـر نفسـي ومن شـر الشيـطان وشركه ، وأن أقتـرف علـى نفسـي سوءا أو أجـره إلـى مسـلم. `,

      `بسـم الله الذي لا يضـر مع اسمـه شيء في الأرض ولا في السمـاء وهـو السمـيع العلـيم. `,

      `رضيـت بالله ربـا وبالإسلام ديـنا وبمحـمد صلى الله عليه وسلم نبيـا. `,

      `ا حي يا قيوم برحمتك أستغيث أصلح لي شأني كله ولا تكلني إلى نفسي طـرفة عين. `,

      `أصبـحـنا وأصبـح المـلك لله رب العـالمـين ، اللهـم إنـي أسـألـك خـير هـذا الـيوم ، فـتحه ، ونصـره ، ونـوره وبـركتـه ، وهـداه ، وأعـوذ بـك مـن شـر ما فـيه وشـر ما بعـده. `,

      `أصبـحـنا على فطرة الإسلام، وعلى كلمة الإخلاص، وعلى دين نبينا محمد صلى الله عليه وسلم، وعلى ملة أبينا إبراهيم حنيفا مسلما وما كان من المشركين. `,

      `لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير. (10 مرات)`,

      `سبحان الله وبحمده(100 مره)`,

      `لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير. (100 مره)`,

      `سبحان الله وبحمده عدد خلقه ورضا نفسه وزنه عرشه ومداد كلماته(3 مرات)`,

      `اللهم اني اسألك علما نافعا ورزقا طيبا وعملا متقبلا`,

      `استغفر الله وأتوب اليه(100 مره)`,

      `سبحان الله(100 مره)`,

      `استغفر الله(100 مره)`,
      `اللهم صل وسلم على نبينا محمد(10 مرات)`,
    ],
  },
  evening: {
    name: "أذكار المساء",
    list: [
      `   أعوذ بالله من الشيطان الرجيم
    الله لا إلـه إلا هو الحي القيوم لا تأخذه سنة ولا نوم له ما في السماوات وما في الأرض من ذا الذي يشفع عنده إلا بإذنه يعلم ما بين أيديهم وما خلفهم ولا يحيطون بشيء من علمه إلا بما شاء وسع كرسيه السماوات والأرض ولا يؤوده حفظهما وهو العلي العظيم.`,

      `    بسم الله الرحمن الرحيم
        قل هو ٱلله أحد، ٱلله ٱلصمد، لم يلد ولم يولد، ولم يكن لهۥ كفوا أحدۢ.(3 مرات)`,

      ` بسم الله الرحمن الرحيم
    قل أعوذ برب ٱلفلق، من شر ما خلق، ومن شر غاسق إذا وقب، ومن شر ٱلنفٰثٰت فى ٱلعقد، ومن شر حاسد إذا حسد.(3 مرات) `,

      `بسم الله الرحمن الرحيم
        قل أعوذ برب ٱلناس، ملك ٱلناس، إلٰه ٱلناس، من شر ٱلوسواس ٱلخناس، ٱلذى يوسوس فى صدور ٱلناس، من ٱلجنة وٱلناس.(3 مرات)`,

      ` أمسينا وأمسى المـلك لله والحمد لله ، لا إله إلا الله وحده لا شريك له، له المـلك وله الحمـد، وهو على كل شيء قدير ، رب أسـألـك خـير ما في هـذه الليله وخـير ما بعـدها ، وأعـوذ بك من شـر ما في هـذه الليله وشر ما بعـدها، رب أعـوذبك من الكسـل وسـوء الكـبر ، رب أعـوذ بك من عـذاب في النـار وعـذاب في القـبر. `,

      `اللهـم بك امسينا وبك أصـبحنا ، وبك نحـيا وبك نمـوت وإلـيك المصير. `,

      `اللهـم أنت ربـي لا إله إلا أنت ، خلقتنـي وأنا عبـدك ، وأنا علـى عهـدك ووعـدك ما استـطعـت ، أعـوذبك من شـر ما صنـعت ، أبـوء لـك بنعـمتـك علـي وأبـوء بذنـبي فاغفـر لي فإنـه لا يغـفر الذنـوب إلا أنت . `,

      `اللهـم إنـي أمسيت أشـهدك ، وأشـهد حملـة عـرشـك ، وملائكتك ، وجمـيع خلـقك ، أنـك أنـت الله لا إله إلا أنـت وحـدك لا شريك لـك ، وأن محمـدا عبـدك ورسـولـك. `,

      `اللهـم ما أمسى بي مـن نعـمة أو بأحـد مـن خلـقك ، فمـنك وحـدك لا شريك لـك ، فلـك الحمـد ولـك الشكـر. `,

      `اللهـم عافـني في بدنـي ، اللهـم عافـني في سمـعي ، اللهـم عافـني في بصـري ، لا إله إلا أنـت. اللهـم إنـي أعـوذ بك من الكـفر ، والفـقر ، وأعـوذ بك من عذاب القـبر ، لا إله إلا أنت `,

      `حسبـي الله لا إله إلا هو علـيه توكـلت وهو رب العرش العظـيم.(7 مرات)`,

      `اللهـم إنـي أسـألـك العـفو والعـافـية في الدنـيا والآخـرة ، اللهـم إنـي أسـألـك العـفو والعـافـية في ديني ودنـياي وأهـلي ومالـي ، اللهـم استـر عـوراتي وآمـن روعاتـي ، اللهـم احفظـني من بـين يدي ومن خلفـي وعن يمـيني وعن شمـالي ، ومن فوقـي ، وأعـوذ بعظمـتك أن أغـتال من تحتـي. `,

      `اللهـم عالـم الغـيب والشـهادة فاطـر السماوات والأرض رب كـل شـيء ومليـكه ، أشهـد أن لا إلـه إلا أنت ، أعـوذ بك من شـر نفسـي ومن شـر الشيـطان وشركه ، وأن أقتـرف علـى نفسـي سوءا أو أجـره إلـى مسـلم. `,

      `بسـم الله الذي لا يضـر مع اسمـه شيء في الأرض ولا في السمـاء وهـو السمـيع العلـيم. `,

      `رضيـت بالله ربـا وبالإسلام ديـنا وبمحـمد صلى الله عليه وسلم نبيـا. `,

      `ا حي يا قيوم برحمتك أستغيث أصلح لي شأني كله ولا تكلني إلى نفسي طـرفة عين. `,

      `أمسينا وامسى المـلك لله رب العـالمـين ، اللهـم إنـي أسـألـك خـير هـذا الـيوم ، فـتحه ، ونصـره ، ونـوره وبـركتـه ، وهـداه ، وأعـوذ بـك مـن شـر ما فـيه وشـر ما بعـده. `,

      `أمسينا على فطرة الإسلام، وعلى كلمة الإخلاص، وعلى دين نبينا محمد صلى الله عليه وسلم، وعلى ملة أبينا إبراهيم حنيفا مسلما وما كان من المشركين. `,

      `لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير. (10 مرات)`,

      `سبحان الله وبحمده(100 مره)`,

      `سبحان الله(100 مره)`,
      `اعوذ بكلمات الله التامات من شر ماخلق(3 مرات)`,
      `استغفر الله(100 مره)`,
      `اللهم صل وسلم على نبينا محمد(10 مرات)`,
    ],
  },
  sleep: {
    name: "أذكار النوم",
    list: [
      `باسمك ربـي وضعـت جنـبي ، وبك أرفعـه، فإن أمسـكت نفسـي فارحـمها ، وإن أرسلتـها فاحفظـها بمـا تحفـظ به عبـادك الصـالحـين. `,

      `باسـمك اللهـم أمـوت وأحـيا. `,

      `اللهـم إنـك خلـقت نفسـي وأنـت توفـاهـا لك ممـاتـها ومحـياها ، إن أحييـتها فاحفظـها ، وإن أمتـها فاغفـر لـها . اللهـم إنـي أسـألـك العـافـية. `,

      `اللهـم قنـي عذابـك يـوم تبـعث عبـادك. (3 مرات)`,

      `اللهـم أسـلمت نفـسي إلـيك، وفوضـت أمـري إلـيك، ووجـهت وجـهي إلـيك، وألـجـات ظهـري إلـيك، رغبـة ورهـبة إلـيك، لا ملجـأ ولا منـجـا منـك إلا إلـيك، آمنـت بكتـابك الـذي أنزلـت وبنبـيـك الـذي أرسلـت. `,

      `سبحان الله.(33 مره)`,

      `الحمد لله (33 مره)`,

      `الله اكبر(33 مره)`,

      `لا اله الا الله وحده لاشريك له له الملك وله الحمد وهو على كل شي قدير(مره واحده)`,

      `يجمع كفيه ثم ينفث فيهما والقراءة فيهما‏:‏ ‏{‏قل هو الله أحد‏}‏ و‏{‏قل أعوذ برب الفلق‏}‏ و‏{‏قل أعوذ برب الناس‏}‏ ومسح ما استطاع من الجسد يبدأ بهما على رأسه ووجه وما أقبل من جسده. (يعمل ذلك ثلاثا)`,

      `أعوذ بالله من الشيطان الرجيم
آمن الرسول بما أنزل إليه من ربه والمؤمنون ۚ كل آمن بالله وملائكته وكتبه ورسله لا نفرق بين أحد من رسله ۚ وقالوا سمعنا وأطعنا غفرانك ربنا وإليك المصير. لا يكلف الله نفسا إلا وسعها لها ما كسبت وعليها ما اكتسبت ربنا لا تؤاخذنا إن نسينا أو أخطأنا ربنا ولا تحمل علينا إصرا كما حملته على الذين من قبلنا ربنا ولا تحملنا ما لا طاقة لنا به واعف عنا واغفر لنا وارحمنا أنت مولانا فانصرنا على القوم الكافرين.`,

      `أعوذ بالله من الشيطان الرجيم
    الله لا إلـه إلا هو الحي القيوم لا تأخذه سنة ولا نوم له ما في السماوات وما في الأرض من ذا الذي يشفع عنده إلا بإذنه يعلم ما بين أيديهم وما خلفهم ولا يحيطون بشيء من علمه إلا بما شاء وسع كرسيه السماوات والأرض ولا يؤوده حفظهما وهو العلي العظيم.`,
    ],
  },
  weekUp: {
    name: "أذكار الاستيقاظ من النوم",
    list: [
      `الحمـد لله الذي أحـيانا بعـد ما أماتـنا وإليه النـشور. `,

      `الحمد لله الذي عافاني في جسدي ورد علي روحي وأذن لي بذكره. `,

      `لا إله إلا الله وحـده لا شـريك له، له الملـك وله الحمـد، وهو على كل شيء قدير، سـبحان الله، والحمـد لله ، ولا إله إلا الله والله أكبر، ولا حول ولا قوة إلا بالله العلي العظيم. رب اغفر لي. `,
    ],
  },
  new: {
    name: "الأذكار المضافه",
    list: []
  },
  comment: {
    name: "التعليقات",
    list: []
  },
};

const body = $("body");

const main = $(".main");
// const header = $("<h1 class=title> فَاذْكُرُونِي أَذْكُرْكُمْ وَاشْكُرُوا لِي وَلَا تَكْفُرُون </h1>");
// main.append(header);

const morningDiv = $("<div></div>");
body.append(morningDiv);

const button = $("<button class=athkar>أذكار</button>");
main.append(button);

let arrayTheker = Object.keys(obj);
const container = $(".container");
container.hide();
button.on("click", () => {
  container.html("");
  addressName();
  $(".newThker").hide();

});
const addressName = () => {
  const start = $(".start");
  start.html("");

  const morningDiv = $("<div id='morning' class='theker'>أذكار الصباح</div>");

  start.append(morningDiv);
  morningDiv.on("click", () => {
    $(".theker").hide();
    $("#morning").show();
    createButtons("morning");
  });

  const eveningDiv = $("<div id='evening' class='theker'>أذكار المساء</div>");
  start.append(eveningDiv);
  eveningDiv.on("click", () => {
    $(".theker").hide();
    $("#evening").show();
    createButtons("evening");
  });

  const sleepDiv = $("<div id='sleep' class='theker'>أذكار النوم</div>");
  start.append(sleepDiv);
  sleepDiv.on("click", () => {
    $(".theker").hide();
    $("#sleep").show();
    createButtons("sleep");
  });

  const weekUpDiv = $(
    "<div id='weekUp' class='theker'>أذكار الأستيقاظ من النوم</div>"
  );
  start.append(weekUpDiv);
  weekUpDiv.on("click", () => {
    $(".theker").hide();
    $("#weekUp").show();
    createButtons("weekUp");
  });

  const addDiv = $("<div id='add' class='theker'>أضافه أذكار</div>");
  start.append(addDiv);
  addDiv.on("click", () => {
    $(".theker").hide();
    $("#add").show();
    // createButtons("add");
    addtion();
  });
  
  const showDiv = $("<div id='show' class='theker'>الأذكار المضافه</div>");
  start.append(showDiv);
  showDiv.on("click", () => {
    $(".theker").hide();
    $("#show").show();
    const value = localStorage.getItem("array");
    if(value !== null) {
      obj.new.list = JSON.parse(value);
    }
    console.log(obj.new.list)
    createButtons("new");
  });
  const commentDiv = $("<div id='comment' class='theker'>التعليقات</div>");
  start.append(commentDiv);
  commentDiv.on("click", () => {
    $(".theker").hide();
    $("#comment").show();
    const value = localStorage.getItem("array");
    if(value !== null) {
      obj.new.list = JSON.parse(value);
    }
    console.log(obj.new.list)
    createButtons("comment");
  });
};
let currentType;
const createButtons = (type) => {
  if (currentType === type) {
    return;
  }
  
  currentType = type;
  let array = obj[type].list;
  let index = 0;

  const textContainer = $(`<div class='textContainer'>${array[index]}</div>`);
  container.show()
  container.html(textContainer);

  const buttonContainer = $("<div class='buttonContainer'></div>");
  const iconLeft = $(`<div class='clickLeft'> <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" fill="currentColor" class="bi bi-arrow-left-square-fill" viewBox="0 0 16 16">
  <path d="M16 14a2 2 0 0 1-2 2H2a2 2 0 0 1-2-2V2a2 2 0 0 1 2-2h12a2 2 0 0 1 2 2v12zm-4.5-6.5H5.707l2.147-2.146a.5.5 0 1 0-.708-.708l-3 3a.5.5 0 0 0 0 .708l3 3a.5.5 0 0 0 .708-.708L5.707 8.5H11.5a.5.5 0 0 0 0-1z"/>
</svg></div>`);
  buttonContainer.html(iconLeft);
  iconLeft.on("click", () => {
    index -= 1;
    showThiker(array, index);
  });
  const iconRight = $(`<div class='clickRight'><svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" fill="currentColor" class="bi bi-arrow-right-square-fill" viewBox="0 0 16 16">
  <path d="M0 14a2 2 0 0 0 2 2h12a2 2 0 0 0 2-2V2a2 2 0 0 0-2-2H2a2 2 0 0 0-2 2v12zm4.5-6.5h5.793L8.146 5.354a.5.5 0 1 1 .708-.708l3 3a.5.5 0 0 1 0 .708l-3 3a.5.5 0 0 1-.708-.708L10.293 8.5H4.5a.5.5 0 0 1 0-1z"/>
</svg></div>`);
  buttonContainer.append(iconRight);
  iconRight.on("click", () => {
    index += 1;
    showThiker(array, index);
  });

  container.append(buttonContainer);
  morningDiv.html("");
};
const showThiker = (array, index) => {
  array[index];
  const textContainer = $(".textContainer");
  textContainer.html(array[index]);
}; 
const addtion = () => {
  const addComment = $("<div class='addComment'></div>");
  main.append(addComment)
  const input = $("<textarea id='text' class='newThker'></textarea>");
  addComment.append(input);
  // window.onload 
  // const addDiv = $("#add");
  const buttonAdd = $("<button id='buttonAdd' class='newThker'>Add</button>");
  addComment.append(buttonAdd);
  
  
  
  buttonAdd.on("click", () => {
    addClick();

    
  });
};
const addClick = () => {
  const input = $("#text").val();
  if(input === ""){
    return
  }
  $("#text").val("")
  const value = localStorage.getItem("array");
  if (value === null) {
    localStorage.setItem("array", JSON.stringify([input]));
  } else {
    let newArray = JSON.parse(value);
    newArray.push(input);
    localStorage.setItem("array", JSON.stringify(newArray));
  }
 
    
};

const comment = $("#commentButton");
comment.on("click", () =>{
  commentClick()
})
const commentClick = () =>{
  const input2 = $("#textUser").val();
  console.log(input2)
  $("#textUser").val("")
  const value1 = localStorage.getItem("comments");
  if (value1 === null) {
    localStorage.setItem("comments", JSON.stringify([input2]));
  } else {
    let newcomment = JSON.parse(value1);
    newcomment.push(input2);
    localStorage.setItem("comments", JSON.stringify(newcomment));
  }

}

